#Композиция

# Определение класса Engine (Двигатель)
class Engine():
    # Метод для запуска двигателя
    def start(self):
        print("Двигатель запущен")

    # Метод для остановки двигателя
    def stop(self):
        print("Двигатель остановлен")

# Определение класса Car (Автомобиль)
class Car():
    # Конструктор класса, который инициализирует объект Engine
    def __init__(self):
        self.engine = Engine()  # Создаем объект класса Engine и присваиваем его атрибуту engine

    # Метод для запуска автомобиля, который делегирует вызов метода start объекту Engine
    def start(self):
        self.engine.start()

    # Метод для остановки автомобиля, который делегирует вызов метода stop объекту Engine
    def stop(self):
        self.engine.stop()

# Создание экземпляра класса Car
my_car = Car()

# Запуск автомобиля (вызов метода start объекта my_car)
my_car.start()

# Остановка автомобиля (вызов метода stop объекта my_car)
my_car.stop()
